app/controllers/avatars_controller.rb

  def index
    @avatars = Avatar.all
---
SELECT * FROM "avatars"

  def show
    @avatar = Avatar.find(params[:id])
---
SELECT * FROM "avatars" WHERE ("avatars"."id" = 1)

  def edit
    @avatar = Avatar.find(params[:id])
---
SELECT * FROM "avatars" WHERE ("avatars"."id" = 1)

  def create
    @avatar = Avatar.new(params[:avatar])

    respond_to do |format|
      if @avatar.save
---
INSERT INTO "avatars" ("size", "content_type", "thumbnail", "parent_id", "filename", "height", "width") VALUES(15239, 'image/jpeg', NULL, NULL, 'homer.jpg', 200, 124)

  def update
    @avatar = Avatar.find(params[:id])
    @avatar.crop!(params[:avatar]) if cropping?

    respond_to do |format|
      if @avatar.update_attributes(params[:avatar])
---
SELECT * FROM "avatars" WHERE ("avatars"."id" = 1)
UPDATE "avatars" SET "size" = 3253, "height" = 77, "width" = 77 WHERE "id" = 11

  def destroy
    @avatar = Avatar.find(params[:id])
    @avatar.destroy
---
SELECT * FROM "avatars" WHERE ("avatars".parent_id = 1)
DELETE FROM "avatars" WHERE "id" = 2